app/Http/Controllers/ApiController.php

insert into `reservations` (`customer_id`, `property_id`, `date`, `status`, `type`, `updated_at`, `created_at`) values (2, '1', '2024-03-16', '0', '0', '2024-03-16 13:10:37', '2024-03-16 13:10:37')
---
    public function store_reservation_to_visit_property(Request $request)
    {


        $validator = Validator::make($request->all(), [
            'customer_id' => 'exists:customers,id',
            'property_id' => 'required|exists:propertys,id',
            'date' => 'required|date|after_or_equal:today',
            'status' => 'in:0,1,2,3',
            'type' => 'in:0,1',

        ]);

        if (!$validator->fails()) {
            // store data
            $payload = JWTAuth::getPayload($this->bearerToken($request));
            $current_user = ($payload['customer_id']);

            $reservation = new Reservation();
            $reservation->customer_id = $current_user;
            $reservation->property_id = $request->property_id;
            $reservation->date = $request->date;
            $reservation->status = $request->status;
            $reservation->type = $request->type;
            $reservation->save();

insert into `offers` (`customer_id`, `property_id`, `date`, `status`, `name`, `phone`, `message`, `updated_at`, `created_at`) values (2, '2', '2024-03-18', '1', 'اسلام خالج', '96555709111', 'عرض بقيمة مليون جنيه', '2024-03-18 18:07:26', '2024-03-18 18:07:26')
---
      public function make_an_offer(Request $request)
      {

          $validator = Validator::make($request->all(), [
              'customer_id' => 'exists:customers,id',
              'property_id' => 'required|exists:propertys,id',
              'date' => 'date|after_or_equal:today',
              'status' => 'nullable|in:0,1,2,3',
              'name'=>'required|string|max:191',
            //   'phone' => 'required|regex:/(01)[0-9]{9}/|min:8|max:12',

              'phone' => ['required', 'regex:/^(0|1|2|3|4|5|6|7|8|9)[0-9]{8,11}$/','min:8','max:12'],

              'message'=>'required|string|max:255',

          ]);

          if (!$validator->fails()) {
              // store data
              $payload = JWTAuth::getPayload($this->bearerToken($request));
              $current_user = ($payload['customer_id']);

              $reservation = new Offer();
              $reservation->customer_id = $current_user;
              $reservation->property_id = $request->property_id;
              $reservation->date = Carbon::now()->toDateString();
              $reservation->status = 0;
              $reservation->name = $request->name;
              $reservation->phone = $request->phone;
              $reservation->message = $request->message;
              $reservation->save();