app/Http/Controllers/CategoryController.php




            $saveCategories->save();
---
insert into `categories` (`image`, `category`, `parameter_types`, `updated_at`, `created_at`) values ('1710525643.4667.jpg', 'dffg', '2', '2024-03-15 18:00:43', '2024-03-15 18:00:43')

    public function updateCategory(Request $request)
    {
        if (!has_permissions('delete', 'categories')) {
            $response['error'] = true;
            $response['message'] = PERMISSION_ERROR_MSG;
            return response()->json($response);
        } else {

            Category::where('id', $request->id)->update(['status' => $request->status]);
---
update `categories` set `status` = '1', `categories`.`updated_at` = '2024-03-15 18:02:49' where `id` = '3'